# Condicionales: Expresiones lambda y apply.

In [10]:
import pandas as pd
datos=pd.DataFrame({'ID':[1,2,3], 'x':[4,5,1], 'y':[5, 8, 9], 'z':[100, 200, 400]})

In [11]:
datos

   ID  x  y    z
0   1  4  5  100
1   2  5  8  200
2   3  1  9  400

In [16]:
for j in range(1,3):
    datos.iloc[:,j]=datos.iloc[:,j].apply(str)

In [18]:
datos.x

0    4
1    5
2    1
Name: x, dtype: object

Concatenarle, municipio a las columnas x y y:

In [19]:

import pandas as pd
datos=pd.DataFrame({'ID':[1,2,3], 'x':[4,5,1], 'y':[5, 8, 9], 'z':[100, 200, 400]})

In [21]:

for j in range(1,3):
    datos.iloc[:,j]=datos.iloc[:,j].apply(lambda x: 'Mpio' + str(x))

In [22]:
datos

   ID      x      y    z
0   1  Mpio4  Mpio5  100
1   2  Mpio5  Mpio8  200
2   3  Mpio1  Mpio9  400

Ejemplo: calcular crecimiento  porcentual del ingreso

In [1]:
import pandas as pd
datos=pd.read_clipboard()

In [31]:
datos=pd.DataFrame({'Semana':[1,2,3,4,5,6,7,8], 'Ventas':[1200,1500,1800,2100,2350,3200,3245,4120]})
datos

   Semana  Ventas
0       1    1200
1       2    1500
2       3    1800
3       4    2100
4       5    2350
5       6    3200
6       7    3245
7       8    4120

In [32]:
datos['cambioporc_ventas']=[np.nan] * datos.shape[0]
for i in range(1,8):
        datos['cambioporc_ventas'].iloc[i]=100*(datos['Ventas'].iloc[i]-datos['Ventas'].iloc[i-1])/datos['Ventas'].iloc[i]
datos

C:\Users\Home\Anaconda3\lib\site-packages\pandas\core\indexing.py:670: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_with_indexer(indexer, value)

   Semana  Ventas  cambioporc_ventas
0       1    1200                NaN
1       2    1500          20.000000
2       3    1800          16.666667
3       4    2100          14.285714
4       5    2350          10.638298
5       6    3200          26.562500
6       7    3245           1.386749
7       8    4120          21.237864

In [39]:
url='https://gist.githubusercontent.com/netj/8836201/raw/6f9306ad21398ea43cba4f7d537619d0e07d5ae3/iris.csv'
iris=pd.read_csv(url)
iris=iris.filter(['sepal.length','sepal.width','variety','petal.length','petal.width'])
iris.head()

   sepal.length  sepal.width variety  petal.length  petal.width
0           5.1          3.5  Setosa           1.4          0.2
1           4.9          3.0  Setosa           1.4          0.2
2           4.7          3.2  Setosa           1.3          0.2
3           4.6          3.1  Setosa           1.5          0.2
4           5.0          3.6  Setosa           1.4          0.2

In [46]:
for j in iris.columns:
    if(pd.api.types.is_numeric_dtype(iris[j])):
        max_value=iris[j].max()
        min_value=iris[j].min()
        iris[j]=(iris[j]-min_value)/(max_value-min_value)
    else:
        iris[j]=iris[j]
iris.head()

   sepal.length  sepal.width variety  petal.length  petal.width
0      0.222222     0.625000  Setosa      0.067797     0.041667
1      0.166667     0.416667  Setosa      0.067797     0.041667
2      0.111111     0.500000  Setosa      0.050847     0.041667
3      0.083333     0.458333  Setosa      0.084746     0.041667
4      0.194444     0.666667  Setosa      0.067797     0.041667

In [56]:
[[iris['sepal.length'].min(), iris['sepal.length'].max()],
[iris['sepal.width'].min(), iris['sepal.width'].max()],
[iris['petal.length'].min(), iris['petal.length'].max()],
[iris['petal.width'].min(), iris['petal.width'].max()]]

[[0.0, 1.0], [0.0, 1.0], [0.0, 1.0], [0.0, 1.0]]

# Expresiones regulares

Expresiones regulares sobre una cadena:
* Devolver Falso o verdadero si el patrón: bool(re.search(patron, string))
* Reemplazar la cadena por otro valor: re.sub(patron_anterior, patron_actual, string)
* Extraer la cadena que cumple el patrón: re.findall(patron, txt)

In [76]:
import re

txt1='colombia es un país bonito'
txt2='Venezuela y colombia son países bonitos'
re.findall("^colombia", txt1)

['colombia']

In [151]:
re.findall("^colombia", txt2)

[]

In [69]:
re.sub("^colombia", "Colombia", txt1)

'Colombia es un país bonito'

In [70]:
re.sub("^colombia", "Colombia", txt2)

'Venezuela y colombia son países bonitos'

In [85]:
bool(re.search("^colombia", txt1))

True

In [86]:
bool(re.search("^colombia", txt2))

False

El patrón más simple: colocar una cadena de texto ("Bogot")

In [90]:
txt = "El municipio de Bogotá es poblado"

In [91]:
bool(re.search('Bogot', txt))

True

In [134]:
re.findall('Bogot', txt)[0]

'Bogot'

In [93]:
re.sub('Bogotá', 'Bogotá D.C.', txt)

'El municipio de Bogotá D.C. es poblado'

Las expresiones regulares pueden aplicarse sobre un pandas dataframe.

In [98]:
df_extranj=pd.DataFrame({'ID_PERS': [1,2,3,4,5,6,7,8,9,10],'Sexo': ['M','F','F','M','F','F','M','F','M','F'],'Pais Nacimiento': ['Esp','Venezuela','Ven','Italia','Peru','Perú','Estados Unidos','EE.UU','República Bolivariana de Venezuela','España']})
df_extranj

   ID_PERS Sexo                     Pais Nacimiento
0        1    M                                 Esp
1        2    F                           Venezuela
2        3    F                                 Ven
3        4    M                              Italia
4        5    F                                Peru
5        6    F                                Perú
6        7    M                      Estados Unidos
7        8    F                               EE.UU
8        9    M  República Bolivariana de Venezuela
9       10    F                              España

Construir una dummy, 1 si es Venezuela, 0 si no:

In [117]:
#bool(re.search('Ven', df_extranj['Pais Nacimiento']))
df_extranj['Ven']=[bool(re.search('Ven', df_extranj['Pais Nacimiento'].iloc[i])) for i in range(10)]
df_extranj['Ven']=df_extranj['Ven'].astype(int)
df_extranj

   ID_PERS Sexo                     Pais Nacimiento  Ven
0        1    M                                 Esp    0
1        2    F                           Venezuela    1
2        3    F                                 Ven    1
3        4    M                              Italia    0
4        5    F                                Peru    0
5        6    F                                Perú    0
6        7    M                      Estados Unidos    0
7        8    F                               EE.UU    0
8        9    M  República Bolivariana de Venezuela    1
9       10    F                              España    0

In [119]:
df_extranj=pd.DataFrame({'ID_PERS': [1,2,3,4,5,6,7,8,9,10],'Sexo': ['M','F','F','M','F','F','M','F','M','F'],'Pais Nacimiento': ['Esp','Venezuela','Ven','Italia','Peru','Perú','Estados Unidos','EE.UU','República Bolivariana de Venezuela','España']})
df_extranj['Pais Nacimiento']=df_extranj['Pais Nacimiento'].apply(lambda x:int(bool(re.search('Ven', x))))
df_extranj

   ID_PERS Sexo  Pais Nacimiento
0        1    M                0
1        2    F                1
2        3    F                1
3        4    M                0
4        5    F                0
5        6    F                0
6        7    M                0
7        8    F                0
8        9    M                1
9       10    F                0

Corregir los que empiezan en Ven a Venezuela

In [126]:
df_extranj=pd.DataFrame({'ID_PERS': [1,2,3,4,5,6,7,8,9,10],'Sexo': ['M','F','F','M','F','F','M','F','M','F'],'Pais Nacimiento': ['Esp','Venezuela','Ven','Italia','Peru','Perú','Estados Unidos','EE.UU','República Bolivariana de Venezuela','España']})
#df_extranj['Pais Nacimiento']=df_extranj['Pais Nacimiento'].apply(lambda x:re.sub('^Ven', 'Venezuela', x))
df_extranj['Pais Nacimiento']=df_extranj['Pais Nacimiento'].apply(lambda x:re.sub(r'^\bVen\b', 'Venezuela', x))
df_extranj

   ID_PERS Sexo                     Pais Nacimiento
0        1    M                                 Esp
1        2    F                           Venezuela
2        3    F                           Venezuela
3        4    M                              Italia
4        5    F                                Peru
5        6    F                                Perú
6        7    M                      Estados Unidos
7        8    F                               EE.UU
8        9    M  República Bolivariana de Venezuela
9       10    F                              España

Expecificar los valores que contienen a Venezuela:

In [149]:
df_extranj=pd.DataFrame({'ID_PERS': [1,2,3,4,5,6,7,8,9,10],'Sexo': ['M','F','F','M','F','F','M','F','M','F'],'Pais Nacimiento': ['Esp','Venezuela','Ven','Italia','Peru','Perú','Estados Unidos','EE.UU','República Bolivariana de Venezuela','España']})
#df_extranj['Pais Nacimiento']=df_extranj['Pais Nacimiento'].apply(lambda x:re.sub('^Ven', 'Venezuela', x))
df_extranj['Pais Nacimiento']=df_extranj['Pais Nacimiento'].apply(lambda x:re.findall('Ven',  x))
df_extranj['Pais Nacimiento']=df_extranj['Pais Nacimiento'].apply(lambda x:x[0] if (len(x) >= 1) else "")
df_extranj

   ID_PERS Sexo Pais Nacimiento
0        1    M
1        2    F             Ven
2        3    F             Ven
3        4    M
4        5    F
5        6    F
6        7    M
7        8    F
8        9    M             Ven
9       10    F

Ejercicio: realizar un ejemplo de cada uno